main/Catalogs/Инфекции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>Инфекции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходитВНациональныйКалендарь</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МесяцаВакцинаций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Месяц</Name>
							<Comment>Возраст указывается как КоличествоМесяцев.КоличествоНедель</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеВозраста</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вакцины</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вакцина</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Вакцины</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

main/Catalogs/Вакцины.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>Вакцины</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВакциныПоКоличествуИнфекцийОтКоторыхОнаЗащищает</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СредняяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бесплатная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отечественная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Инфекции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инфекция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инфекции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

main/CommonModules/ОбщегоНазначенияСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьДатуВакцинацииПоДатеРождения(Знач ДатаРождения, Знач ВозрастВакцинации) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаРождения) Тогда
		Возврат Дата("00010101");
	КонецЕсли;
	
	МесяцевВакцинации = Цел(ВозрастВакцинации);
	ДатаВакцинации = ДобавитьКДате(ДатаРождения, МесяцевВакцинации, "МЕСЯЦ");
	
	НедельВакцинации = (ВозрастВакцинации - МесяцевВакцинации) * 10;
	ДатаВакцинации = ДобавитьКДате(ДатаВакцинации, НедельВакцинации, "НЕДЕЛЯ");
	
	Возврат ДатаВакцинации	
	
КонецФункции

Функция ПолучитьВозрастВакцинацииПоДатеРождения(Знач ДатаРождения, Знач ДатаВакцинации) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаРождения) Тогда
		Возврат 0;
	КонецЕсли;
	
	ВозрастВакцинации = РазностьДат(ДатаРождения, ДатаВакцинации, "МЕСЯЦ");
	
	ДатаВакцинацииПромежуточная = ДобавитьКДате(ДатаРождения, ВозрастВакцинации, "МЕСЯЦ"); 
	
	Пока ДатаВакцинацииПромежуточная < ДатаВакцинации Цикл
		ВозрастВакцинации = ВозрастВакцинации + 0.1; // увеличили возраст вакцинации на 1 неделю
		ДатаВакцинацииПромежуточная = ДобавитьКДате(ДатаВакцинацииПромежуточная, 1, "НЕДЕЛЯ");
	КонецЦикла;
	
	Возврат ВозрастВакцинации;
	
КонецФункции

Функция ПолучитьДоступныеВакциныПоИнфекции(Инфекция) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнфекцииВакцины.Вакцина КАК Вакцина
		|ИЗ
		|	Справочник.Инфекции.Вакцины КАК ИнфекцииВакцины
		|ГДЕ
		|	ИнфекцииВакцины.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Инфекция);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Вакцина");
	
КонецФункции

Функция ПолучитьДатуРожденияРебенка(Ребенок) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Дети.ДатаРождения КАК ДатаРождения
		|ИЗ
		|	Справочник.Дети КАК Дети
		|ГДЕ
		|	Дети.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ребенок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаРождения) Тогда
		Возврат ВыборкаДетальныеЗаписи.ДатаРождения;
	Иначе
		Возврат Дата("00010101");
	КонецЕсли;
	
КонецФункции

Функция ДобавитьКДате(ДатаНачала, КоличествоПериодов, ТипПериода) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(&ДатаНачала, ТипПериода, КоличествоПериодов) КАК НоваяДата";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТипПериода", ТипПериода);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КоличествоПериодов", КоличествоПериодов);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.НоваяДата;
	
КонецФункции

Функция РазностьДат(ДатаНачала, ДатаОкончания, ТипПериода) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РазностьДат(&ДатаНачала, &ДатаОкончания, ТипПериода) КАК РазностьДат";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТипПериода", ТипПериода);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.РазностьДат;
	
КонецФункции

Функция СтруктураРегистраСведений(ИмяРегистра) Экспорт
	
	МенеджерЗаписи = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
	МетаданныеРегистра = Метаданные.РегистрыСведений[ИмяРегистра];
	
	ЗаписьКакСтруктура = Новый Структура;
	
	Для Каждого Поле Из МетаданныеРегистра.Измерения Цикл
		ЗаписьКакСтруктура.Вставить(Поле.Имя, МенеджерЗаписи[Поле.Имя]);
	КонецЦикла;
	Для Каждого Поле Из МетаданныеРегистра.Ресурсы Цикл
		ЗаписьКакСтруктура.Вставить(Поле.Имя, МенеджерЗаписи[Поле.Имя]);
	КонецЦикла;
	Для Каждого Поле Из МетаданныеРегистра.Реквизиты Цикл
		ЗаписьКакСтруктура.Вставить(Поле.Имя, МенеджерЗаписи[Поле.Имя]);
	КонецЦикла;
	
	Возврат ЗаписьКакСтруктура;
	
КонецФункции

Функция ПолучитьКлючЗаписиРегистраСведений(ИмяРегистра, СтруктураДанных) Экспорт
	
	КлючЗаписи = РегистрыСведений[ИмяРегистра].СоздатьКлючЗаписи(СтруктураДанных);
	
	Возврат КлючЗаписи;
	
КонецФункции

Процедура ОбработатьСтруктуруИзУведомления(СтруктураДанных) Экспорт
	
	Для каждого КлючЗначение Из СтруктураДанных Цикл
		Если КлючЗначение.Ключ = "Ребенок" Тогда
			СтруктураДанных[КлючЗначение.Ключ] = Справочники.Дети.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючЗначение.Значение));
		ИначеЕсли КлючЗначение.Ключ = "Инфекция" Тогда
			СтруктураДанных[КлючЗначение.Ключ] = Справочники.Инфекции.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючЗначение.Значение));
		ИначеЕсли КлючЗначение.Ключ = "Вакцина" Тогда
			СтруктураДанных[КлючЗначение.Ключ] = Справочники.Вакцины.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючЗначение.Значение));
		ИначеЕсли КлючЗначение.Ключ = "ДатаВакцинации" Тогда
			СтруктураДанных[КлючЗначение.Ключ] = ПрочитатьДатуJSON(КлючЗначение.Значение, ФорматДатыJSON.ISO);;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
